!
#
%
&
'
(
)
*
+
,
-
.
0
1
2
3
4
5
6
7
8
9
:
;
=
?
@
A
B
C
D
E
F
G
H
I
J
K
L
M
N
O
P
Q
R
S
T
U
V
W
X
Y
Z
[
\
]
_
`
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
{
|
}
~
·
Ι
Φ
Χ
Ω
α
β
γ
δ
ζ
λ
μ
π
ω
В
И
К
М
О
Т
Ц
а
к
о
р
т
х
–
—
―
‘
’
“
”
…
‰
′
℃
Ⅰ
Ⅱ
Ⅲ
Ⅳ
Ⅴ
Ⅷ
Ⅸ
←
↑
→
↓
↘
∕
√
∞
∠
∩
∶
≈
≠
≤
≥
①
②
③
④
⑤
⑥
⑦
⑧
⑨
⑩
⒈
⒉
⒊
─
┵
╱
▂
█
▌
■
□
▲
▼
◆
◇
○
◎
●
◥
★
☆
、
。
〇
〈
〉
《
》
「
」
『
』
【
】
〔
〕
〖
〗
ア
イ
ク
ダ
テ
ト
ド
バ
マ
ル
レ
ㄧ
㎡
一
丁
七
万
丈
三
上
下
不
与
丐
丑
专
且
丕
世
丘
丙
业
丛
东
丝
丞
丢
两
严
並
丧
丨
个
丫
中
丰
串
临
丶
丸
丹
为
主
丼
丽
举
乂
乃
久
么
义
之
乌
乍
乎
乏
乐
乒
乓
乔
乖
乘
乙
乜
九
乞
也
习
乡
书
买
乱
乳
乸
乾
了
予
争
事
二
于
亏
云
互
亓
五
井
亘
亚
些
亟
亡
亢
交
亥
亦
产
亨
亩
享
京
亭
亮
亲
亳
亵
亶
人
亿
什
仁
仄
仅
仆
仇
仉
今
介
仍
从
仑
仓
仔
仕
他
仗
付
仙
仚
仝
仞
仟
仡
代
令
以
仨
仪
仫
们
仰
仲
仳
仵
件
价
任
份
仿
企
伉
伊
伍
伎
伏
伐
休
伕
众
优
伙
会
伛
伝
伞
伟
传
伢
伤
伦
伧
伪
伫
伯
估
伴
伶
伸
伺
似
伽
佁
佃
但
佈
位
低
住
佐
佑
体
佔
何
佗
佘
余
佚
佛
作
佝
佞
佟
你
佢
佣
佥
佩
佬
佯
佰
佳
佶
佺
佻
佼
佾
使
侃
侄
來
侈
侉
例
侍
侏
侑
侔
侗
供
依
侠
侣
侥
侦
侧
侨
侪
侬
侮
侯
侵
便
係
促
俄
俅
俊
俋
俎
俏
俐
俑
俗
俘
俚
保
俞
俟
信
俣
俦
俨
俩
俪
俬
俭
修
俯
俱
俶
俸
俺
俾
個
倌
倍
倏
們
倒
倔
倖
倘
候
倚
倜
借
倡
倥
倦
倨
倩
倪
倬
倭
倶
债
值
倾
偁
偃
假
偈
偌
偎
偏
偕
做
停
健
偬
偲
偶
偷
偻
偿
傀
傅
傈
傍
備
傣
傥
储
傩
催
傲
傳
傻
僅
像
僖
僚
僜
僧
僭
僮
僰
僳
僵
僻
儀
億
儆
儋
儍
儒
儡
優
儿
兀
允
元
兄
充
兆
先
光
克
免
兑
兒
兔
兖
党
兜
兟
兢
入
內
全
兩
八
公
六
兮
兰
共
关
兴
兵
其
具
典
兹
养
兼
兽
冀
内
冇
冈
冉
册
再
冏
冑
冒
冕
冗
写
军
农
冠
冢
冤
冥
冬
冯
冰
冲
决
冴
况
冶
冷
冻
冼
冽
冿
净
凄
准
凇
凈
凉
凊
凋
凌
减
凑
凛
凝
几
凡
凤
凫
凭
凯
凰
凳
凶
凸
凹
出
击
凼
函
凿
刀
刁
刃
分
切
刊
刍
刎
刑
划
列
刘
则
刚
创
初
删
判
別
刨
利
别
刮
到
制
刷
券
刹
刺
刻
刽
剁
剂
剃
則
剉
削
剌
前
剎
剐
剑
剔
剖
剜
剥
剧
剩
剪
副
割
創
剽
剿
劀
劇
劈
劉
劏
力
劝
办
功
加
务
劢
劣
动
助
努
劫
劭
励
劲
劳
劵
効
劻
劼
劾
势
勁
勃
勅
勇
勉
勋
勍
勐
勒
動
勖
勘
勝
募
勢
勤
勰
勳
勺
勾
勿
匀
包
匆
匈
匍
匐
匕
化
北
匙
匝
匠
匡
匣
匪
匮
匹
区
医
匾
匿
十
千
卅
升
午
卉
半
卍
华
协
卑
卒
卓
单
卖
南
博
卜
卞
卟
占
卡
卢
卣
卤
卦
卧
卫
卯
印
危
即
却
卵
卷
卸
卻
卾
卿
厂
厄
厅
历
厉
压
厌
厐
厕
厘
厚
厝
原
厢
厥
厦
厨
厩
厮
去
县
叁
参
又
叉
及
友
双
反
发
叔
取
受
变
叙
叛
叟
叠
叡
口
古
句
另
叨
叩
只
叫
召
叭
叮
可
台
叱
史
右
叵
叶
号
司
叹
叻
叼
叽
吁
吃
各
吆
合
吉
吊
吋
同
名
后
吏
吐
向
吒
吓
吕
吖
吗
君
吝
吞
吟
吠
吣
吥
否
吧
吨
吩
含
听
吭
吮
启
吱
吲
吳
吴
吵
吶
吸
吹
吻
吼
吾
吿
呀
呂
呃
呆
呇
呈
告
呎
呐
呓
呔
呕
呖
呗
员
呙
呛
呜
呢
呣
呤
呦
周
呯
呱
呲
味
呵
呷
呸
呻
呼
命
咀
咂
咄
咆
咋
和
咎
咏
咐
咒
咔
咕
咖
咘
咙
咚
咛
咣
咤
咥
咦
咧
咨
咩
咪
咫
咬
咭
咯
咱
咲
咳
咸
咻
咽
咿
哀
品
哄
哆
哇
哈
哉
哋
哌
响
哎
哏
哐
哑
哒
哓
哔
哗
哙
哚
哞
哟
員
哥
哦
哧
哨
哩
哪
哭
哮
哲
哺
哼
哽
唁
唆
唇
唉
唏
唐
唑
唔
唠
唢
唤
唧
唬
售
唯
唰
唱
唳
唵
唾
啁
啃
啄
商
啉
啊
問
啐
啓
啕
啖
啜
啡
啤
啥
啦
啧
啪
啬
啭
啮
啰
啵
啷
啸
啻
啼
啾
喀
喂
喃
善
喆
喇
喉
喊
喋
喎
喏
喑
喔
喘
喙
喜
喝
喟
喦
喧
喬
單
喱
喳
喵
喷
喹
喺
喻
喽
嗄
嗅
嗑
嗒
嗓
嗔
嗖
嗜
嗝
嗞
嗟
嗡
嗣
嗤
嗦
嗨
嗪
嗫
嗮
嗯
嗲
嗳
嗵
嗷
嗼
嗽
嘀
嘁
嘅
嘈
嘉
嘌
嘎
嘏
嘘
嘚
嘛
嘞
嘟
嘣
嘤
嘨
嘬
嘭
嘱
嘲
嘴
嘶
嘹
嘻
嘿
噁
噌
噎
噏
噔
噗
噘
噙
噜
噢
噤
器
噩
噪
噬
噱
噶
噻
噼
嚅
嚎
嚏
嚓
嚣
嚯
嚷
嚼
囊
囍
囔
囚
四
回
因
囡
团
囤
囧
囫
园
囯
困
囱
围
囵
囹
固
国
图
囿
圃
圄
圆
圈
國
圜
土
圣
在
圩
圪
圭
圮
地
圳
圹
场
圻
圾
址
坂
均
坊
坍
坎
坏
坐
坑
块
坚
坛
坝
坞
坟
坠
坡
坤
坦
坨
坪
坯
坳
坶
坷
垂
垃
垄
垅
垆
垇
型
垌
垒
垓
垕
垚
垛
垟
垠
垡
垢
垣
垦
垩
垫
垭
垮
垱
垴
垵
垸
垾
埂
埃
埇
埋
城
埔
埕
埗
域
埠
埭
埯
埴
培
基
埼
堀
堂
堃
堆
堇
堑
堕
堡
堤
堪
堰
報
場
堵
堺
堽
塆
塌
塑
塔
塘
塙
塚
塞
填
塬
塭
塾
墀
墁
境
墅
墉
墊
墒
墓
墕
増
墙
增
墟
墨
墩
壁
壅
壆
壑
壕
壤
士
壬
壮
声
壳
壶
壹
处
备
复
夏
夔
夕
外
夙
多
夜
够
夥
大
天
太
夫
夭
央
夯
失
头
夷
夸
夹
夺
奂
奄
奇
奈
奉
奋
奎
奏
契
奓
奔
奕
奖
套
奘
奚
奠
奢
奥
奧
奭
女
奴
奶
奸
她
好
妁
如
妃
妄
妆
妇
妈
妊
妍
妒
妓
妖
妙
妚
妞
妣
妤
妥
妨
妩
妪
妫
妮
妯
妲
妳
妹
妻
妾
姆
姊
始
姍
姐
姑
姓
委
姗
姘
姚
姜
姝
姣
姥
姨
姪
姬
姮
姹
姻
姽
姿
威
娃
娄
娅
娆
娇
娈
娉
娌
娑
娓
娘
娜
娟
娠
娣
娥
娩
娭
娱
娲
娳
娴
娶
娼
婀
婁
婆
婉
婊
婓
婕
婚
婢
婧
婪
婫
婳
婴
婵
婶
婷
婺
婿
媒
媚
媛
媞
媪
媲
媳
媾
嫁
嫂
嫉
嫌
嫔
嫖
嫚
嫡
嫣
嫦
嫨
嫩
嫫
嬅
嬉
嬖
嬗
嬛
嬢
嬴
嬷
孀
孃
子
孑
孔
孕
孖
字
存
孙
孚
孜
孝
孟
孢
季
孤
学
孩
孪
孫
孬
孰
孱
孳
孵
學
孺
孽
宁
它
宅
宇
守
安
宋
完
宏
宓
宕
宗
官
宙
定
宛
宜
宝
实
宠
审
客
宣
室
宥
宦
宪
宫
宮
宰
害
宴
宵
家
宸
容
宽
宾
宿
寂
寄
寅
密
寇
富
寐
寒
寓
寔
寝
寞
察
寡
寤
寥
實
寨
寮
寰
寶
寸
对
寺
寻
导
寿
封
射
将
將
尉
尊
尋
對
小
尐
少
尓
尔
尕
尖
尘
尚
尝
尤
尧
尬
就
尴
尷
尸
尹
尺
尼
尽
尾
尿
局
屁
层
屃
居
屈
屉
届
屋
屌
屎
屏
屐
屑
展
属
屠
屡
層
履
屯
山
屹
屾
屿
岁
岂
岌
岐
岑
岔
岖
岗
岘
岙
岚
岛
岡
岩
岫
岬
岭
岱
岳
岵
岷
岸
岺
岽
岿
峁
峄
峇
峋
峒
峙
峡
峣
峤
峥
峦
峨
峪
峭
峯
峰
島
峻
崀
崁
崂
崃
崆
崇
崌
崎
崐
崑
崔
崖
崛
崟
崧
崩
崭
崮
崴
崽
崾
嵇
嵊
嵋
嵌
嵎
嵘
嵩
嵯
嵴
嶂
嶋
嶙
嶝
巅
巍
巘
川
州
巡
巢
工
左
巧
巨
巩
巫
差
巯
己
已
巳
巴
巷
巽
巾
巿
币
市
布
帅
帆
师
希
帏
帐
帑
帔
帕
帖
帘
帙
帚
帛
帜
帝
帥
带
帧
席
帮
帶
帷
常
帼
帽
幂
幄
幅
幌
幔
幕
幞
幡
幢
幫
干
平
年
并
幷
幸
幺
幻
幼
幽
幾
广
庄
庆
庇
床
序
庐
庑
库
应
底
庖
店
庙
庚
府
庞
废
庠
庥
度
座
庭
庵
庶
康
庸
庹
庾
廂
廉
廊
廍
廓
廖
廢
廪
延
廷
建
廿
开
弁
异
弃
弄
弈
弊
弋
式
弑
弓
弔
引
弗
弘
弛
弟
张
弢
弥
弦
弧
弩
弭
弯
弱
張
強
弹
强
弼
彌
归
当
录
彗
彘
彝
彟
形
彤
彥
彦
彧
彩
彪
彬
彭
彰
影
彷
役
彻
彼
往
征
徂
径
待
徇
很
徉
徊
律
後
徐
徒
徕
得
徘
徙
徜
從
御
徨
復
循
微
徳
徵
德
徽
心
必
忆
忌
忍
忏
忐
忑
忒
忖
志
忘
忙
忠
忡
忤
忧
忪
快
忱
念
忻
忼
忽
忾
忿
怀
态
怂
怃
怄
怅
怆
怍
怎
怏
怒
怔
怕
怖
怜
思
怠
怡
急
怦
性
怨
怪
怯
怱
怵
总
怼
怿
恁
恂
恃
恋
恍
恐
恒
恓
恕
恙
恚
恢
恣
恤
恨
恩
恪
恫
恬
恭
息
恰
恳
恵
恶
恸
恹
恺
恻
恼
恽
恿
悄
悉
悌
悍
悔
悖
悚
悝
悟
悠
患
悦
您
悬
悭
悯
悱
悲
悴
悸
悻
悼
情
惆
惇
惊
惋
惑
惕
惘
惚
惜
惟
惠
惦
惧
惨
惩
惫
惬
惭
惮
惯
惰
想
惴
惶
惹
惺
愁
愆
愈
愉
愍
愎
意
愕
愚
愛
感
愠
愣
愤
愧
愫
愿
慄
慈
態
慌
慎
慑
慓
慕
慜
慢
慧
慨
慰
慵
慷
慾
憂
憋
憎
憑
憔
憧
憨
憩
憬
憶
憷
憾
懂
懈
懊
懋
懑
懒
懔
懦
懵
懸
懽
懿
戈
戉
戊
戋
戌
戍
戎
戏
成
我
戒
戕
或
戗
战
戚
戛
戟
戡
截
戬
戮
戰
戲
戳
戴
户
戾
房
所
扁
扃
扇
扈
扉
手
才
扎
扑
扒
打
扔
托
扛
扞
扣
扥
扦
执
扩
扪
扫
扬
扭
扮
扯
扰
扳
扶
批
扼
扽
找
承
技
抄
抉
把
抑
抒
抓
抔
投
抖
抗
折
抚
抛
抟
抠
抡
抢
护
报
抨
披
抬
抭
抱
抵
抹
抻
押
抽
抿
拂
拄
担
拆
拇
拈
拉
拋
拌
拍
拎
拐
拒
拓
拔
拖
拗
拘
拙
拚
招
拜
拟
拢
拣
拥
拦
拧
拨
择
括
拭
拮
拯
拱
拳
拴
拷
拼
拽
拾
拿
持
挂
指
挈
按
挎
挑
挖
挚
挛
挝
挞
挟
挠
挡
挣
挤
挥
挨
挪
挫
挭
振
挲
挹
挺
挻
挽
捂
捃
捅
捆
捉
捋
捌
捍
捎
捏
捐
捕
捞
损
捡
换
捣
捧
捨
捭
据
捱
捲
捶
捷
捺
捻
掀
掂
掇
授
掉
掌
掏
掐
排
掖
掘
掞
掠
採
探
掣
接
控
推
掩
措
掬
掮
掰
掳
掴
掷
掸
掺
掼
掾
揄
揆
揉
揍
描
提
插
揖
揠
握
揣
揩
揪
揭
援
揶
揺
揽
揾
搀
搁
搂
搅
搏
搐
搓
搔
搜
搞
搠
搡
搥
搧
搪
搬
搭
携
搽
摁
摃
摄
摆
摇
摈
摊
摒
摔
摘
摞
摧
摩
摭
摸
摹
撂
撅
撇
撑
撒
撕
撘
撞
撤
撩
撬
播
撮
撰
撵
撷
撸
撺
撼
擀
擁
擂
擅
操
擎
擒
擔
擕
擗
擘
據
擞
擢
擦
擿
攀
攉
攒
攘
攝
攥
攫
支
收
攸
改
攻
放
政
敀
故
效
敉
敌
敎
敏
救
敕
敖
教
敛
敝
敞
敢
散
敦
敩
敬
数
敲
整
敷
數
文
斋
斌
斐
斑
斓
斗
料
斛
斜
斟
斡
斤
斥
斧
斩
斫
断
斯
新
斷
方
於
施
旁
旂
旃
旅
旋
旌
旎
族
旖
旗
无
既
日
旦
旧
旨
早
旬
旭
旮
旯
旱
时
旷
旸
旺
旻
旼
昀
昂
昆
昇
昉
昊
昌
明
昏
易
昔
昕
昙
昝
星
映
昤
春
昧
昨
昭
是
昱
昳
昴
昵
昶
昼
显
晁
時
晃
晋
晌
晏
晒
晓
晔
晕
晖
晗
晚
晛
晞
晟
晤
晦
晨
晩
普
景
晰
晳
晴
晶
智
晾
暂
暄
暇
暌
暐
暑
暖
暗
暢
暧
暨
暮
暴
暹
暻
暾
曁
曈
曉
曌
曙
曜
曝
曦
曩
曰
曲
曳
更
曹
曼
曾
替
最
會
月
有
朋
服
朏
朐
朔
朕
朗
望
朝
期
朦
木
未
末
本
札
术
朱
朴
朵
机
朽
朿
杀
杂
权
杆
杈
杉
李
杏
材
村
杖
杜
杞
束
杠
条
来
杨
杩
杪
杭
杯
杰
東
杲
杳
杵
杷
杼
松
板
极
构
枇
枉
枋
析
枕
林
枚
果
枝
枞
枢
枣
枥
枧
枪
枫
枭
枯
枰
枳
架
枷
枸
柁
柃
柄
柉
柏
某
柑
柒
染
柔
柘
柚
柜
柞
柠
柢
查
柩
柬
柯
柰
柱
柳
柴
柷
査
柽
柿
栀
栃
栅
标
栈
栉
栋
栎
栏
树
栓
栖
栗
校
栢
栩
株
栲
样
核
根
格
栽
栾
桀
桁
桂
桃
桅
框
案
桉
桋
桌
桎
桐
桑
桓
桔
桕
桠
桢
档
桥
桦
桧
桨
桩
桲
桶
桷
梁
梅
梆
梏
梓
梗
梢
梦
梧
梨
梭
梯
械
梳
梵
检
棂
棉
棋
棍
棒
棕
棘
棚
棠
棣
森
棰
棱
棵
棹
棺
棻
椁
椅
植
椎
椐
椑
椒
椤
椪
椭
椰
椴
椹
椽
椿
楂
楊
楔
楚
楞
楠
楣
楫
業
楮
極
楷
楸
楹
楼
概
榄
榆
榇
榈
榊
榔
榕
榘
榛
榜
榧
榨
榫
榭
榴
榷
榻
槁
槃
槌
槎
槐
槙
槚
槛
槜
槟
槭
槲
槺
槻
槽
槿
樊
樋
樑
樓
樗
標
樜
樟
模
樣
樨
横
樯
樱
樵
樽
樾
橄
橇
橘
橙
橛
機
橡
橥
橱
橹
檀
檄
檐
檔
檞
檣
檩
檫
檬
欠
次
欢
欣
欧
欲
欷
欺
款
歆
歇
歉
歌
歐
歔
歙
歡
止
正
此
步
武
歧
歪
歷
歹
死
歼
殁
殃
殄
殆
殇
殉
殊
残
殒
殓
殖
殚
殛
殡
殳
殴
段
殷
殺
殿
毁
毂
毅
毋
母
毎
每
毑
毒
毓
比
毕
毖
毗
毙
毛
毡
毫
毬
毯
毽
氏
氐
民
氓
气
氘
氙
氛
氟
氡
氢
氣
氤
氦
氧
氨
氮
氯
氰
氲
水
氵
永
氹
氽
氾
汀
汁
求
汆
汇
汉
汊
汐
汕
汗
汛
汝
汞
江
池
污
汤
汨
汩
汪
汭
汰
汲
汴
汶
汹
決
汽
汾
沁
沂
沃
沅
沆
沇
沈
沉
沌
沏
沐
沒
沓
沔
沙
沚
沛
沟
没
沣
沤
沥
沦
沧
沩
沪
沫
沭
沮
沱
河
沸
油
治
沼
沽
沾
沿
泄
泅
泉
泊
泌
泐
泓
泔
法
泗
泛
泞
泠
泡
波
泣
泥
注
泪
泫
泮
泯
泰
泱
泳
泵
泷
泸
泺
泻
泼
泽
泾
泿
洁
洇
洋
洌
洎
洑
洒
洗
洙
洛
洞
津
洨
洪
洮
洱
洲
洵
洸
洹
洺
活
洼
洽
派
流
浃
浅
浆
浇
浈
浉
浊
测
浍
济
浏
浐
浑
浒
浓
浔
浙
浚
浜
浠
浣
浦
浩
浪
浬
浮
浯
浴
海
浸
浹
涂
涅
消
涉
涌
涎
涓
涔
涕
涛
涝
涞
涟
涡
涣
涤
润
涧
涨
涩
涪
涮
涯
液
涵
涸
涿
淀
淄
淅
淆
淇
淋
淌
淏
淑
淖
淘
淙
淝
淞
淠
淡
淤
淦
淩
淫
淬
淮
深
淳
混
淸
淹
添
淼
渃
清
渊
渌
渍
渎
渐
渑
渔
渗
渚
減
渝
渠
渡
渣
渤
渥
温
渭
港
渲
渴
游
渺
湃
湄
湉
湍
湎
湖
湘
湛
湜
湟
湧
湫
湮
湼
湾
湿
溃
溅
溆
溉
溍
溏
源
準
溘
溜
溟
溢
溥
溦
溧
溪
溫
溯
溱
溶
溺
滁
滂
滇
滋
滑
滓
滔
滕
滗
滚
滞
滟
滠
满
滢
滤
滥
滦
滨
滩
滴
滹
漂
漆
漈
漉
漏
漓
演
漕
漖
漠
漢
漩
漪
漫
漯
漱
漳
漶
漷
漸
漹
漾
潇
潋
潍
潏
潘
潜
潞
潟
潢
潦
潭
潮
潲
潴
潸
潺
潼
澄
澈
澍
澎
澓
澙
澛
澜
澡
澧
澪
澫
澳
澶
澹
激
濂
濉
濑
濒
濛
濠
濡
濬
濮
濯
濺
瀑
瀚
瀛
瀟
瀣
灌
灏
灞
火
灭
灯
灰
灵
灶
灸
灼
灾
灿
炀
炅
炆
炉
炊
炎
炒
炕
炖
炘
炙
炜
炫
炬
炭
炮
炯
炳
炷
炸
点
為
炼
炽
烁
烂
烃
烈
烊
烓
烔
烘
烙
烚
烛
烜
烟
烤
烦
烧
烨
烩
烫
烬
热
烯
烱
烷
烹
烺
烽
焉
焊
焌
焐
焕
焖
焗
焘
焙
焚
焜
無
焦
焯
焰
焱
然
煅
煊
煌
煎
煕
煜
煞
煤
煦
照
煨
煬
煮
煲
煳
煸
煺
煽
熀
熄
熊
熏
熔
熘
熙
熟
熠
熨
熬
熱
熵
熹
熺
燁
燃
燊
燎
燕
燚
燠
燥
燧
燮
燹
爆
爨
爪
爬
爰
爱
爵
父
爷
爸
爹
爻
爽
爾
爿
牀
片
版
牌
牍
牒
牙
牛
牝
牞
牟
牠
牡
牢
牦
牧
物
牲
牵
特
牺
牾
犀
犁
犄
犇
犊
犍
犏
犒
犟
犬
犯
犰
犴
状
犷
犸
犹
狂
狄
狈
狍
狎
狐
狒
狗
狙
狞
狠
狡
狩
独
狭
狮
狰
狱
狳
狸
狼
猁
猎
猕
猖
猗
猘
猛
猜
猝
猞
猥
猩
猪
猫
猬
献
猴
猷
猾
猿
獅
獒
獗
獠
獨
獭
獲
獻
獾
玄
率
玉
王
玎
玑
玒
玓
玖
玗
玚
玛
玟
玢
玥
玩
玫
玮
环
现
玲
玳
玷
玹
玺
玻
珀
珂
珅
珈
珉
珊
珍
珏
珐
珑
珖
珙
珜
珞
珠
珣
珥
珩
珪
班
珮
珲
珵
珺
現
球
琅
理
琇
琉
琊
琍
琏
琐
琓
琚
琛
琢
琤
琥
琦
琨
琪
琬
琮
琯
琰
琳
琴
琵
琶
琼
瑀
瑁
瑄
瑆
瑕
瑗
瑙
瑚
瑛
瑜
瑞
瑟
瑪
瑭
瑯
瑰
瑱
瑶
瑸
瑾
璀
璃
璆
璇
璈
璋
璎
璏
璐
璗
璜
璞
璟
璠
璧
璨
璫
璺
瓒
瓘
瓜
瓞
瓠
瓢
瓣
瓤
瓦
瓮
瓯
瓴
瓶
瓷
甄
甑
甘
甙
甚
甜
生
產
甥
甦
用
甩
甪
甫
甬
甭
甯
田
由
甲
申
电
男
甸
町
画
甾
畅
畈
畊
界
畏
畔
留
畚
畛
畜
畠
略
畦
番
畬
畲
畴
當
畸
畹
畿
疁
疃
疆
疋
疍
疏
疑
疒
疔
疖
疗
疙
疚
疝
疟
疠
疡
疣
疤
疥
疫
疬
疮
疯
疱
疲
疳
疴
疵
疷
疸
疹
疼
疽
疾
痂
病
症
痈
痉
痊
痍
痒
痔
痕
痘
痛
痞
痢
痣
痤
痧
痨
痪
痫
痰
痱
痴
痹
痼
痾
痿
瘀
瘁
瘌
瘐
瘗
瘘
瘙
瘟
瘠
瘢
瘤
瘦
瘩
瘪
瘫
瘴
瘸
瘼
瘾
癀
癌
癖
癜
癞
癣
癫
癮
癯
癸
登
發
白
百
皂
的
皆
皇
皈
皋
皎
皐
皑
皓
皖
皙
皮
皱
皲
皴
皿
盂
盅
盆
盈
益
盌
盎
盏
盐
监
盒
盔
盖
盗
盘
盛
盝
盟
盡
盥
目
盯
盱
盲
直
相
盹
盼
盾
省
眈
眉
看
県
眙
真
眠
眢
眦
眨
眩
眬
眭
眯
眶
眷
眸
眺
眼
眾
着
睁
睇
睌
睐
睑
睚
睛
睡
睢
督
睦
睨
睪
睫
睬
睱
睹
睽
睾
睿
瞄
瞅
瞋
瞌
瞎
瞑
瞒
瞟
瞠
瞥
瞧
瞩
瞪
瞬
瞭
瞰
瞳
瞻
瞾
瞿
矇
矍
矗
矛
矜
矢
矣
知
矩
矫
短
矮
石
矶
矸
矾
矿
砀
码
砂
砌
砍
砒
研
砖
砗
砚
砝
砟
砣
砥
砧
砭
砰
破
砷
砸
砺
砻
砼
砾
础
硅
硌
硏
硐
硒
硕
硖
硚
硝
硫
硬
确
硼
碁
碇
碉
碌
碍
碎
碑
碓
碗
碘
碚
碛
碜
碟
碣
碧
碰
碱
碲
碳
碴
碶
碽
碾
磁
磅
磊
磋
磎
磐
磕
磡
磨
磬
磲
磴
磷
磺
礁
礅
礒
礠
礡
礤
礴
示
礼
礽
社
祀
祁
祈
祉
祎
祐
祕
祖
祗
祚
祛
祜
祝
神
祟
祠
祢
祥
祧
票
祭
祯
祲
祷
祸
祺
祼
祾
祿
禀
禁
禄
禅
禎
福
禑
禚
禛
禤
禥
禧
禹
禺
离
禽
禾
秀
私
秃
秆
秉
秋
种
科
秒
秘
租
秣
秤
秦
秧
秩
秫
秭
积
称
秸
移
秽
秾
稀
稂
稅
程
稍
税
稔
稗
稚
稞
稠
稢
稣
種
稱
稳
稷
稹
稻
稼
稽
稿
穆
穉
穗
穰
穴
究
穷
穹
空
穿
突
窃
窄
窅
窆
窈
窍
窑
窒
窕
窖
窗
窘
窜
窝
窟
窠
窥
窦
窨
窭
窿
竇
立
竖
站
竞
竟
章
竣
童
竭
端
竹
竺
竽
竿
笃
笄
笆
笈
笊
笋
笏
笑
笔
笕
笙
笛
笞
笠
笤
符
笨
笪
笫
第
笳
笺
笼
筆
等
筊
筋
筏
筐
筑
筒
答
策
筛
筜
筝
筠
筮
筱
筲
筵
筷
筹
筼
签
简
箅
箍
箐
箓
箔
箕
算
箜
管
箧
箩
箫
箬
箭
箱
箴
箸
節
篁
篆
篇
篌
篑
篓
篙
篝
篡
篦
篪
篮
篱
篷
篼
篾
簇
簋
簒
簣
簧
簪
簸
簾
簿
籁
籍
籛
米
类
籼
籽
粄
粉
粑
粒
粕
粗
粘
粝
粟
粢
粤
粥
粨
粪
粮
粱
粳
粹
粼
粽
精
粿
糁
糅
糊
糌
糍
糕
糖
糗
糙
糜
糟
糠
糨
糯
系
紀
紅
紊
納
級
紛
素
索
紧
紫
累
細
組
絆
結
絕
絗
絜
給
絮
絶
綁
綑
經
綜
綠
綦
維
綮
網
緊
緋
緘
線
緣
編
緻
縈
縢
總
繁
繆
繢
繹
繼
纂
續
纖
纠
红
纣
纤
约
级
纨
纪
纫
纬
纭
纯
纰
纱
纲
纳
纵
纶
纷
纸
纹
纺
纽
纾
线
绀
练
组
绅
细
织
终
绉
绊
绌
绍
绎
经
绐
绑
绒
结
绔
绕
绗
绘
给
绚
绛
络
绝
绞
统
绢
绣
绥
绦
继
绩
绪
绫
续
绮
绯
绰
绳
维
绵
绶
绷
绸
绺
绻
综
绽
绾
绿
缀
缃
缄
缅
缆
缇
缈
缉
缎
缒
缓
缔
缕
编
缘
缙
缚
缛
缜
缝
缠
缡
缢
缣
缤
缥
缦
缨
缩
缪
缫
缭
缮
缰
缱
缴
缶
缸
缺
罂
罄
罅
罈
罍
罐
网
罔
罕
罗
罘
罚
罡
罢
罩
罪
置
署
罷
罹
罾
羁
羅
羊
羌
美
羔
羚
羝
羞
羟
羡
羣
群
羧
羨
羯
羰
羲
羸
羹
羽
羿
翀
翁
翃
翅
翊
翌
翎
翔
翕
翘
翚
翛
翟
翠
翡
翥
翦
翩
翮
翯
翰
翱
翳
翻
翼
耀
老
考
耄
者
耆
耋
而
耍
耐
耒
耔
耕
耗
耘
耙
耦
耳
耶
耷
耸
耻
耽
耿
聂
聃
聆
聊
聋
职
聒
联
聘
聚
聩
聪
職
聽
聿
肃
肄
肆
肇
肉
肋
肌
肓
肖
肘
肚
肛
肝
肟
肠
股
肢
肤
肥
肩
肪
肮
肯
肱
育
肴
肸
肺
肽
肾
肿
胀
胁
胃
胄
胆
背
胎
胖
胗
胙
胚
胛
胜
胝
胞
胡
胤
胥
胧
胪
胫
胭
胯
胰
胱
胳
胴
胶
胸
胺
胼
能
脂
脆
脉
脊
脍
脏
脐
脑
脓
脔
脖
脘
脚
脢
脯
脱
脲
脸
脾
腆
腈
腊
腋
腌
腐
腑
腓
腔
腕
腚
腠
腥
腩
腭
腮
腰
腱
腳
腴
腸
腹
腺
腻
腼
腾
腿
膀
膈
膊
膏
膑
膘
膛
膜
膝
膦
膨
膳
膺
膻
膽
臀
臂
臃
臆
臊
臟
臣
臧
自
臬
臭
至
致
臻
臼
臾
舀
舁
舂
舄
舅
舆
與
舉
舌
舍
舐
舒
舔
舖
舛
舜
舞
舟
舢
舨
航
舫
般
舰
舱
舵
舶
舷
舸
船
舺
舾
艄
艇
艉
艋
艏
艘
艮
良
艰
色
艳
艺
艾
艿
节
芃
芈
芊
芋
芍
芎
芒
芗
芘
芙
芜
芝
芡
芥
芦
芨
芩
芪
芫
芬
芭
芮
芯
花
芳
芷
芸
芹
芽
芾
苁
苄
苇
苋
苍
苎
苏
苑
苒
苓
苔
苕
苗
苛
苜
苞
苟
苡
苣
若
苦
苫
苯
英
苷
苹
苻
苾
茀
茁
茂
范
茄
茅
茆
茉
茌
茎
茏
茔
茕
茗
茜
茧
茨
茫
茬
茭
茯
茱
茴
茵
茶
茸
茹
茼
荀
荃
荆
荇
草
荍
荏
荐
荒
荔
荚
荞
荟
荠
荡
荣
荤
荥
荦
荧
荨
荩
荪
荫
荭
药
荳
荷
荸
荻
荼
荽
莅
莆
莉
莊
莎
莒
莓
莘
莞
莠
莫
莱
莲
莳
莴
获
莹
莺
莼
莽
菀
菁
菅
菇
菉
菊
菌
菏
菔
菖
菘
菜
菟
菠
菡
菩
華
菰
菱
菲
菴
菹
萁
萃
萄
萋
萌
萍
萎
萘
萜
萝
萤
营
萦
萧
萨
萩
萱
萸
萼
落
葆
著
葚
葛
葠
葡
董
葩
葫
葬
葭
葱
葳
葵
葺
蒂
蒋
蒌
蒙
蒜
蒟
蒡
蒨
蒯
蒲
蒸
蒺
蒻
蒾
蒿
蓄
蓉
蓑
蓓
蓖
蓝
蓟
蓥
蓦
蓬
蓮
蓼
蓿
蔑
蔓
蔗
蔘
蔚
蔡
蔫
蔬
蔵
蔷
蔸
蔺
蔻
蔼
蔽
蕃
蕈
蕉
蕊
蕙
蕤
蕨
蕲
蕴
蕹
蕻
蕾
薄
薇
薏
薙
薛
薨
薪
薮
薯
薰
薷
薹
藁
藉
藏
藐
藓
藕
藜
藝
藠
藤
藩
藴
藻
藿
蘅
蘇
蘑
蘖
蘧
蘭
蘸
虎
虏
虐
虑
虔
處
虚
虞
號
虢
虫
虬
虱
虹
虺
虻
虽
虾
蚀
蚁
蚂
蚊
蚌
蚍
蚓
蚕
蚜
蚝
蚣
蚤
蚩
蚪
蚯
蚱
蚵
蚶
蚾
蛀
蛆
蛇
蛉
蛊
蛋
蛎
蛏
蛐
蛔
蛙
蛛
蛞
蛟
蛤
蛭
蛮
蛰
蛳
蛴
蛹
蛾
蜀
蜂
蜃
蜇
蜈
蜉
蜊
蜍
蜒
蜓
蜕
蜗
蜘
蜚
蜜
蜞
蜡
蜢
蜥
蜱
蜴
蜷
蜻
蜿
蝇
蝈
蝉
蝌
蝎
蝓
蝗
蝙
蝠
蝤
蝮
蝰
蝴
蝶
蝼
蝾
螂
螃
螈
融
螨
螭
螯
螳
螺
螽
蟀
蟆
蟊
蟋
蟑
蟒
蟠
蟥
蟹
蟾
蠓
蠕
蠡
蠢
蠲
蠵
蠹
血
衄
衅
行
衍
衒
術
衔
衖
街
衘
衙
衛
衡
衢
衣
补
表
衩
衫
衬
衮
衰
衷
衽
衾
衿
袁
袂
袄
袅
袈
袋
袍
袒
袖
袜
袤
被
袭
袱
袴
裁
裂
装
裆
裔
裕
裘
裙
補
裟
裡
裢
裤
裨
裬
裱
裳
裴
裸
裹
裼
製
裾
褂
褊
褐
褒
褓
褔
褙
褚
褛
褡
褥
褪
褫
褯
褰
褴
褶
襁
襄
襞
襟
襦
西
要
覃
覆
視
覺
觀
见
观
规
觅
视
览
觉
觊
觎
觐
觑
角
觚
觞
解
觥
触
觳
言
訇
討
記
設
証
訾
評
詞
話
該
詹
誉
誊
誌
誓
誜
語
說
調
請
論
謙
講
謝
謠
謦
警
譬
護
變
讏
讓
讚
计
订
讣
认
讥
讦
讧
讨
让
讪
讫
训
议
讯
记
讲
讳
讴
讵
讶
讷
许
讹
论
讼
讽
设
访
诀
证
诃
评
诅
识
诈
诉
诊
诋
词
诏
译
诒
诔
试
诗
诘
诙
诚
诛
诜
话
诞
诟
诠
诡
询
诣
诤
该
详
诧
诨
诩
诫
诬
语
诮
误
诰
诱
诲
诳
说
诵
诶
请
诸
诺
读
诽
课
诿
谀
谁
调
谄
谅
谆
谈
谊
谋
谌
谍
谎
谏
谐
谑
谒
谓
谔
谕
谗
谘
谙
谚
谛
谜
谝
谟
谡
谢
谣
谤
谥
谦
谧
谨
谩
谪
谬
谭
谮
谯
谰
谱
谲
谳
谴
谶
谷
谿
豁
豆
豇
豉
豌
豕
豚
象
豢
豪
豫
豸
豹
豺
貂
貅
貉
貌
貔
負
貣
責
貼
賢
質
賴
賽
贇
贝
贞
负
贠
贡
财
责
贤
败
账
货
质
贩
贪
贫
贬
购
贮
贯
贰
贱
贲
贳
贴
贵
贷
贸
费
贺
贻
贼
贽
贾
贿
赁
赂
赃
资
赅
赈
赉
赊
赋
赌
赎
赏
赐
赑
赓
赔
赖
赘
赙
赚
赛
赜
赝
赞
赟
赠
赡
赢
赣
赤
赦
赧
赫
赭
走
赳
赴
赵
赶
起
趁
趄
超
越
趋
趔
趟
趣
足
趴
趵
趸
趾
跂
跃
跄
跆
跋
跌
跎
跑
跖
跗
跚
跛
距
跟
跡
跤
跨
跪
跬
路
跳
践
跶
跷
跸
跹
跺
跻
踆
踉
踊
踌
踏
踔
踝
踞
踟
踢
踩
踪
踮
踱
踵
踹
踺
踼
踽
蹂
蹄
蹇
蹈
蹉
蹊
蹋
蹑
蹒
蹙
蹚
蹟
蹦
蹩
蹬
蹭
蹲
蹴
蹶
蹺
蹻
蹼
蹿
躁
躇
躏
躐
身
躬
躯
躲
躹
躺
軌
軍
載
輔
輕
輪
輯
轉
车
轧
轨
轩
轫
转
轮
软
轰
轱
轲
轴
轶
轸
轻
轼
载
轾
轿
较
辄
辅
辆
辇
辈
辉
辊
辋
辍
辎
辐
辑
输
辔
辕
辖
辗
辘
辙
辛
辜
辞
辟
辣
辨
辩
辫
辰
辱
辶
边
辽
达
迁
迂
迄
迅
过
迈
迊
迎
运
近
迓
返
迕
还
这
进
远
违
连
迟
迢
迤
迥
迦
迩
迪
迫
迭
述
迳
迴
迷
迸
迹
迺
追
退
送
适
逃
逄
逅
逆
选
逊
逋
逍
透
逐
递
途
逗
這
通
逛
逝
逞
速
造
逡
逢
逦
逮
逯
週
進
逵
逶
逸
逹
逻
逼
逾
遁
遂
遆
遇
運
遍
過
遏
遐
遑
遒
道
達
遗
遛
遠
遢
遣
遥
遨
適
遭
遮
遴
遵
選
遺
遽
避
邀
邂
邃
還
邈
邊
邋
邑
邓
邕
邗
邙
邛
邝
邠
邡
邢
那
邦
邨
邪
邬
邮
邯
邰
邱
邳
邴
邵
邸
邹
邺
邻
邽
邾
郁
郄
郅
郇
郊
郎
郏
郑
郓
郗
郜
郝
郞
郡
郢
郦
郧
部
郪
郫
郭
郯
郴
郸
都
郾
鄂
鄄
鄙
鄞
鄠
鄢
鄧
鄯
鄱
鄴
酃
酆
酉
酊
酋
酌
配
酏
酐
酒
酗
酚
酝
酞
酣
酥
酩
酪
酬
酮
酯
酰
酱
酵
酶
酷
酸
酽
酿
醇
醉
醋
醌
醍
醐
醒
醚
醛
醣
醪
醮
醴
醺
釆
采
釉
释
里
重
野
量
金
釜
鈺
鉄
鉴
鉻
銘
銬
銮
鋆
錄
錾
鎏
鏖
鐘
鐲
鑑
鑫
钇
针
钉
钊
钍
钎
钏
钐
钒
钓
钕
钗
钙
钚
钛
钜
钝
钞
钟
钠
钡
钢
钣
钤
钥
钦
钧
钨
钩
钫
钮
钯
钰
钱
钲
钳
钴
钵
钺
钻
钼
钽
钾
钿
铀
铁
铂
铃
铄
铅
铆
铈
铉
铊
铋
铌
铎
铐
铗
铛
铜
铝
铟
铠
铡
铢
铣
铤
铧
铨
铩
铬
铭
铮
铯
铰
铱
铲
铳
铵
银
铷
铸
铺
铼
链
铿
销
锁
锂
锃
锄
锅
锆
锈
锉
锋
锌
锎
锏
锐
锑
锒
锓
锗
错
锚
锛
锜
锞
锟
锡
锢
锣
锤
锥
锦
锨
锭
键
锯
锰
锱
锲
锴
锵
锶
锷
锸
锹
锺
锻
镀
镁
镂
镆
镇
镉
镊
镌
镍
镏
镐
镑
镒
镓
镔
镕
镖
镚
镛
镜
镝
镞
镟
镠
镣
镧
镩
镫
镬
镭
镯
镰
镳
镶
長
长
開
閒
間
閤
闆
闇
關
闢
门
闩
闪
闫
闭
问
闯
闰
闱
闲
间
闵
闷
闸
闹
闺
闻
闼
闽
闾
闿
阀
阁
阂
阄
阅
阆
阈
阉
阋
阍
阎
阐
阑
阔
阕
阖
阙
阚
阜
队
阡
阪
阮
阱
防
阳
阴
阵
阶
阺
阻
阿
陀
陂
附
际
陆
陇
陈
陉
陋
陌
降
限
陕
陛
陝
陞
陟
陡
院
除
陨
险
陪
陬
陲
陳
陵
陶
陷
陽
隅
隆
隊
隋
隍
随
隐
隔
隗
隘
隙
障
隧
隨
隳
隶
隸
隻
隼
隽
难
雀
雁
雄
雅
集
雇
雉
雌
雍
雏
雒
雕
雖
難
雨
雪
雯
雳
零
雷
雹
電
雾
需
霁
霂
霄
霆
震
霈
霉
霍
霎
霏
霑
霓
霖
霜
霞
霢
霭
霰
露
霸
霹
霾
靑
青
靓
靖
静
靚
靛
靜
非
靠
靡
面
靥
靧
革
靭
靳
靴
靶
靼
鞅
鞋
鞍
鞑
鞘
鞠
鞣
鞭
韁
韋
韓
韡
韦
韧
韩
韪
韫
韬
韭
音
韵
韶
韻
順
頌
頔
頗
領
頫
頭
頻
題
顎
顏
類
顯
页
顶
顷
项
顺
须
顼
顽
顾
顿
颀
颁
颂
颃
预
颅
领
颇
颈
颉
颊
颌
颍
颏
颐
频
颓
颔
颖
颗
题
颚
颛
颜
额
颞
颠
颢
颤
颦
颧
风
飏
飒
飓
飕
飖
飘
飙
飚
飛
飞
食
飢
飧
飨
飾
餐
餮
饎
饕
饥
饧
饨
饩
饪
饫
饬
饭
饮
饯
饰
饱
饲
饴
饵
饶
饷
饺
饼
饽
饿
馀
馁
馄
馅
馆
馈
馊
馋
馍
馏
馐
馒
馔
馕
首
馗
香
馥
馨
馬
馼
騰
马
驭
驮
驯
驰
驱
驳
驴
驶
驷
驸
驹
驺
驻
驼
驾
驿
骁
骂
骄
骅
骆
骇
骈
骉
骊
骋
验
骏
骐
骑
骕
骗
骚
骛
骜
骝
骞
骠
骡
骤
骥
骧
骨
骰
骶
骷
骸
骺
骼
髀
髁
髂
髅
髈
髋
髌
髓
體
高
髙
髦
髭
髮
髯
髻
鬃
鬆
鬈
鬏
鬓
鬟
鬣
鬧
鬲
鬻
鬼
魁
魂
魄
魅
魇
魏
魔
魚
鮟
鮰
鯢
鱀
鱇
鱻
鱼
鱿
鲀
鲁
鲂
鲅
鲆
鲇
鲈
鲊
鲋
鲍
鲎
鲑
鲔
鲛
鲜
鲟
鲠
鲡
鲢
鲣
鲤
鲧
鲨
鲩
鲫
鲭
鲮
鲱
鲲
鲳
鲵
鲶
鲷
鲸
鲽
鳃
鳄
鳅
鳆
鳊
鳌
鳍
鳏
鳔
鳕
鳖
鳗
鳜
鳝
鳞
鳟
鴎
鵄
鵟
鵰
鶲
鷹
鸟
鸠
鸡
鸢
鸣
鸥
鸦
鸨
鸩
鸪
鸫
鸭
鸮
鸯
鸳
鸵
鸶
鸷
鸸
鸻
鸽
鸾
鸿
鹂
鹃
鹄
鹅
鹆
鹈
鹉
鹊
鹋
鹌
鹍
鹏
鹑
鹕
鹗
鹘
鹜
鹞
鹟
鹣
鹤
鹦
鹧
鹫
鹬
鹭
鹮
鹰
鹳
鹿
麀
麂
麅
麈
麋
麒
麓
麗
麝
麟
麦
麸
麻
麼
麽
麾
麿
黃
黄
黍
黎
黏
黐
黑
黒
黔
默
黛
黜
黝
黟
黠
黢
黧
黩
黯
鼎
鼐
鼓
鼠
鼬
鼻
鼾
齐
齿
龃
龄
龅
龇
龈
龉
龊
龋
龌
龍
龑
龙
龚
龛
龟
︰
︱
﹃
﹄
﹐
﹑
﹒
﹔
﹕
﹖
﹗
﹝
﹞
﹢
﹤
﹥
﹪
！
＂
％
＆
（
）
＊
＋
，
－
．
／
０
１
２
３
４
５
６
７
８
９
：
；
＜
＝
＞
？
＠
Ａ
Ｂ
Ｃ
Ｄ
Ｅ
Ｆ
Ｇ
Ｈ
Ｉ
Ｊ
Ｋ
Ｌ
Ｍ
Ｎ
Ｏ
Ｐ
Ｑ
Ｒ
Ｓ
Ｔ
Ｕ
Ｖ
Ｗ
Ｘ
Ｙ
［
＼
］
＿
ａ
ｂ
ｃ
ｄ
ｅ
ｇ
ｈ
ｉ
ｊ
ｌ
ｍ
ｎ
ｏ
ｐ
ｒ
ｓ
ｔ
ｖ
ｗ
ｘ
｜
～
